Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runsc/tomcat/target_count_5/repeat_22/5.txt
2020/02/06 16:37:21 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8005/
2020/02/06 16:37:51 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 44645 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8005
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      44645
Failed requests:        0
Non-2xx responses:      44646
Total transferred:      38752728 bytes
HTML transferred:       31832598 bytes
Requests per second:    1488.16 [#/sec] (mean)
Time per request:       67.197 [ms] (mean)
Time per request:       0.672 [ms] (mean, across all concurrent requests)
Transfer rate:          1261.48 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4  15.7      2    1007
Processing:     0   63  79.1     32    1155
Waiting:        0   61  73.3     32    1020
Total:          1   66  80.6     36    1159
Percentage of the requests served within a certain time (ms)
  50%     36
  66%     69
  75%     90
  80%    106
  90%    204
  95%    216
  98%    234
  99%    258
 100%   1159 (longest request)
2020/02/06 16:37:51 Matched stat line [Connect:        0    4  15.7      2    1007 Connect 0 4 15.7 2 1007]
2020/02/06 16:37:51 Matched stat line [Processing:     0   63  79.1     32    1155 Processing 0 63 79.1 32 1155]
2020/02/06 16:37:51 Matched stat line [Waiting:        0   61  73.3     32    1020 Waiting 0 61 73.3 32 1020]
2020/02/06 16:37:51 Matched stat line [Total:          1   66  80.6     36    1159 Total 1 66 80.6 36 1159]
2020/02/06 16:37:51 Matched percentline [  50%     36 50 36]
{"connect":{"max":1007,"mean":4,"median":2,"min":0,"stdDev":15.699999809265137},"percentiles":{"100":1159,"50":36,"66":69,"75":90,"80":106,"90":204,"95":216,"98":234,"99":258},"processing":{"max":1155,"mean":63,"median":32,"min":0,"stdDev":79.0999984741211},"total":{"max":1159,"mean":66,"median":36,"min":1,"stdDev":80.5999984741211},"waiting":{"max":1020,"mean":61,"median":32,"min":0,"stdDev":73.30000305175781}}
2020/02/06 16:37:51 Matched percentline [  66%     69 66 69]
2020/02/06 16:37:51 Matched percentline [  75%     90 75 90]
2020/02/06 16:37:51 Matched percentline [  80%    106 80 106]
2020/02/06 16:37:51 Matched percentline [  90%    204 90 204]
2020/02/06 16:37:51 Matched percentline [  95%    216 95 216]
2020/02/06 16:37:51 Matched percentline [  98%    234 98 234]
2020/02/06 16:37:51 Matched percentline [  99%    258 99 258]
2020/02/06 16:37:51 Matched percentline [ 100%   1159 100 1159]